// holidays.js
// Список всех нерабочих дней в Казахстане, включая праздники и переносы.
export const KAZAKHSTAN_HOLIDAYS = [
  // Январь
  "2025-01-01", 
  "2025-01-02", 
  "2025-01-03", 
  "2025-01-04", 
  "2025-01-07", 
  // Март
  "2025-03-10", 
  "2025-03-21", 
  "2025-03-22", 
  "2025-03-23", 
  "2025-03-24", 
  "2025-03-25", 
  // Май
  "2025-05-01", 
  "2025-05-07", 
  "2025-05-09", 
  // Июнь
  "2025-06-06", 
  // Июль
  "2025-07-07", 
  // Август
  "2025-08-05", 
  // Сентябрь
  "2025-09-01", 
  // Октябрь
  "2025-10-25", 
  "2025-10-26", 
  // Декабрь
  "2025-12-16", 
  "2025-12-17",
];